; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v6 ?v10)
             (pred_3 ?v9 ?v12)
             (pred_2 ?v6 ?v12)
             (pred_11 ?v5 ?v6 )
	     (pred_6 ?v6)
             (pred_1 ?v3)
             (pred_4 ?v9)
             (pred_9 ?v12)
             (pred_5 ?v6)
             (pred_12 ?v9)
             (pred_8 ?v6)
             (pred_7 ))



(:action op_5
:parameters (?v7 ?v13 ?v2 ?v4)
:precondition (and (pred_1 ?v7) (pred_1 ?v13) (pred_4 ?v2) (pred_9 ?v4)
          (pred_10 ?v7 ?v13) (pred_3 ?v2 ?v4)
                   (pred_2 ?v13 ?v4) (pred_6 ?v7) 
                   (pred_5 ?v13) (pred_12 ?v2))
:effect (and  (pred_8 ?v13) (not (pred_5 ?v13))))


(:action op_4
:parameters (?v7 ?v11)
:precondition (and (pred_1 ?v7) (pred_1 ?v11)
               (pred_6 ?v7) (pred_10 ?v7 ?v11) (pred_8 ?v11))
:effect (and (pred_6 ?v11) (not (pred_6 ?v7))))

(:action op_3
:parameters (?v7 ?v2)
:precondition (and (pred_1 ?v7) (pred_4 ?v2) 
                  (pred_6 ?v7) (pred_11 ?v2 ?v7) (pred_7 ))
:effect (and (pred_12 ?v2)
   (not (pred_11 ?v2 ?v7)) (not (pred_7 ))))


(:action op_1
:parameters (?v7 ?v1 ?v8)
:precondition (and (pred_1 ?v7) (pred_4 ?v1) (pred_4 ?v8)
                  (pred_6 ?v7) (pred_12 ?v8) (pred_11 ?v1 ?v7))
:effect (and (pred_12 ?v1) (pred_11 ?v8 ?v7)
        (not (pred_12 ?v8)) (not (pred_11 ?v1 ?v7))))

(:action op_2
:parameters (?v7 ?v2)
:precondition (and (pred_1 ?v7) (pred_4 ?v2) 
                  (pred_6 ?v7) (pred_12 ?v2))
:effect (and (pred_7 ) (pred_11 ?v2 ?v7) (not (pred_12 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_02 obj_11 obj_08 obj_15 obj_06 obj_10 obj_24 obj_14 obj_09 obj_25 obj_13 obj_05 obj_16 obj_31 obj_01 obj_27 obj_23 obj_26 obj_12 obj_30 obj_22 obj_21 obj_03 obj_20
    obj_18 obj_04 obj_07
    obj_29 obj_28 obj_19
    )

    (:init
       (pred_7)

       (pred_1 obj_17)
       (pred_1 obj_02)
       (pred_1 obj_11)
       (pred_1 obj_08)
       (pred_1 obj_15)
       (pred_1 obj_06)
       (pred_1 obj_10)
       (pred_1 obj_24)
       (pred_1 obj_14)
       (pred_1 obj_09)
       (pred_1 obj_25)
       (pred_1 obj_13)
       (pred_1 obj_05)
       (pred_1 obj_16)
       (pred_1 obj_31)
       (pred_1 obj_01)
       (pred_1 obj_27)
       (pred_1 obj_23)
       (pred_1 obj_26)
       (pred_1 obj_12)
       (pred_1 obj_30)
       (pred_1 obj_22)
       (pred_1 obj_21)
       (pred_1 obj_03)
       (pred_1 obj_20)
       (pred_9 obj_18)
       (pred_9 obj_04)
       (pred_9 obj_07)
       (pred_4 obj_29)
       (pred_4 obj_28)
       (pred_4 obj_19)

       (pred_10 obj_17 obj_06)
       (pred_10 obj_17 obj_02)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_02 obj_11)
       (pred_10 obj_02 obj_17)
       (pred_10 obj_11 obj_24)
       (pred_10 obj_11 obj_08)
       (pred_10 obj_11 obj_02)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_08 obj_15)
       (pred_10 obj_08 obj_11)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_15 obj_08)
       (pred_10 obj_06 obj_25)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_06 obj_17)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_10 obj_24)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_24 obj_05)
       (pred_10 obj_24 obj_14)
       (pred_10 obj_24 obj_11)
       (pred_10 obj_24 obj_10)
       (pred_10 obj_14 obj_16)
       (pred_10 obj_14 obj_09)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_14 obj_24)
       (pred_10 obj_09 obj_31)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_09 obj_14)
       (pred_10 obj_25 obj_01)
       (pred_10 obj_25 obj_13)
       (pred_10 obj_25 obj_06)
       (pred_10 obj_13 obj_27)
       (pred_10 obj_13 obj_05)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_25)
       (pred_10 obj_05 obj_23)
       (pred_10 obj_05 obj_16)
       (pred_10 obj_05 obj_24)
       (pred_10 obj_05 obj_13)
       (pred_10 obj_16 obj_26)
       (pred_10 obj_16 obj_31)
       (pred_10 obj_16 obj_14)
       (pred_10 obj_16 obj_05)
       (pred_10 obj_31 obj_12)
       (pred_10 obj_31 obj_09)
       (pred_10 obj_31 obj_16)
       (pred_10 obj_01 obj_30)
       (pred_10 obj_01 obj_27)
       (pred_10 obj_01 obj_25)
       (pred_10 obj_27 obj_22)
       (pred_10 obj_27 obj_23)
       (pred_10 obj_27 obj_13)
       (pred_10 obj_27 obj_01)
       (pred_10 obj_23 obj_21)
       (pred_10 obj_23 obj_26)
       (pred_10 obj_23 obj_05)
       (pred_10 obj_23 obj_27)
       (pred_10 obj_26 obj_03)
       (pred_10 obj_26 obj_12)
       (pred_10 obj_26 obj_16)
       (pred_10 obj_26 obj_23)
       (pred_10 obj_12 obj_20)
       (pred_10 obj_12 obj_31)
       (pred_10 obj_12 obj_26)
       (pred_10 obj_30 obj_22)
       (pred_10 obj_30 obj_01)
       (pred_10 obj_22 obj_21)
       (pred_10 obj_22 obj_27)
       (pred_10 obj_22 obj_30)
       (pred_10 obj_21 obj_03)
       (pred_10 obj_21 obj_23)
       (pred_10 obj_21 obj_22)
       (pred_10 obj_03 obj_20)
       (pred_10 obj_03 obj_26)
       (pred_10 obj_03 obj_21)
       (pred_10 obj_20 obj_12)
       (pred_10 obj_20 obj_03)
       (pred_5 obj_12)
       (pred_5 obj_15)
       (pred_5 obj_16)
       (pred_2  obj_12 obj_18)
       (pred_2  obj_15 obj_04)
       (pred_2  obj_16 obj_07)
       (pred_8 obj_17)
       (pred_8 obj_02)
       (pred_8 obj_11)
       (pred_8 obj_08)
       (pred_8 obj_06)
       (pred_8 obj_10)
       (pred_8 obj_24)
       (pred_8 obj_14)
       (pred_8 obj_09)
       (pred_8 obj_25)
       (pred_8 obj_13)
       (pred_8 obj_05)
       (pred_8 obj_31)
       (pred_8 obj_01)
       (pred_8 obj_27)
       (pred_8 obj_23)
       (pred_8 obj_26)
       (pred_8 obj_30)
       (pred_8 obj_22)
       (pred_8 obj_21)
       (pred_8 obj_03)
       (pred_8 obj_20)

       (pred_3  obj_29 obj_18)
       (pred_3  obj_28 obj_04)
       (pred_3  obj_19 obj_07)
       (pred_11 obj_29 obj_11)
       (pred_11 obj_28 obj_17)
       (pred_11 obj_19 obj_09)
       (pred_6 obj_14)
    )

    (:goal (and
       (pred_11 obj_29 obj_24)
       (pred_11 obj_19 obj_17)
    ))
(:constraints
  (always (not (pred_6 obj_08)))
)
)

; plan
1. (op_4 obj_14 obj_09)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_09)
   goals met: 0 of 2
2. (op_3 obj_09 obj_19)
   deleted: (pred_11 obj_19 obj_09) (pred_7)
   added: (pred_12 obj_19)
   goals met: 0 of 2
3. (op_4 obj_09 obj_14)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_14)
   goals met: 0 of 2
4. (op_4 obj_14 obj_24)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_24)
   goals met: 0 of 2
5. (op_4 obj_24 obj_11)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_11)
   goals met: 0 of 2
6. (op_1 obj_11 obj_29 obj_19)
   deleted: (pred_12 obj_19) (pred_11 obj_29 obj_11)
   added: (pred_12 obj_29) (pred_11 obj_19 obj_11)
   goals met: 0 of 2
7. (op_4 obj_11 obj_24)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_24)
   goals met: 0 of 2
8. (op_2 obj_24 obj_29)
   deleted: (pred_12 obj_29)
   added: (pred_7) (pred_11 obj_29 obj_24)
   goals met: 1 of 2
9. (op_4 obj_24 obj_11)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_11)
   goals met: 1 of 2
10. (op_3 obj_11 obj_19)
   deleted: (pred_11 obj_19 obj_11) (pred_7)
   added: (pred_12 obj_19)
   goals met: 1 of 2
11. (op_4 obj_11 obj_02)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_02)
   goals met: 1 of 2
12. (op_4 obj_02 obj_17)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_17)
   goals met: 1 of 2
13. (op_1 obj_17 obj_28 obj_19)
   deleted: (pred_12 obj_19) (pred_11 obj_28 obj_17)
   added: (pred_12 obj_28) (pred_11 obj_19 obj_17)
   goals met: 2 of 2
